       IDENTIFICATION DIVISION.
       PROGRAM-ID. FLAG.
       DATA DIVISION. WORKING-STORAGE SECTION. 01 FLG.
       05 FLGBASE32A PIC X(32) VALUE "{{flg1}}".
       05 FLGBASE32B PIC X(32) VALUE "{{flg2}}".
       PROCEDURE DIVISION. BEGIN. DISPLAY FLG. STOP RUN.